"""
問題 1
ユーザーに好物を聞いてそれを favorite_food という変数に入れるコードを書いてください。
favorite_food を print して入力された好物が入っていることを確認してください。



問題 2
ユーザーに数値を入れるよう促して、それが半径の円の大きさを返す関数を書いてください。



問題 3
ユーザーに昨年見た映画の本数を聞いてそれを movies という変数に入れ、
メッセージを返す関数を書いてください。 例えば 3 という入力があった場合は
"I saw 3 movies last year." というメッセージが変えるようにしてください。
0 や 1 のときは単数、2 本以上は複数形になる対応が必要です。


問題 4
好物を聞いてそれを リスト に入れて返す関数を書いてください。 
ユーザーには5回インプットを促し、リストに５つ好物が入るようにしてください。


問題 5
注：この問題はまだ習っていないデータ型（ディクショナリ）を使って解く問題です。
自分で調べて書く練習のため余裕があればぜひトライしてください。
ユーザーが簡単な辞書を作れるような関数を書いてください。 
ユーザーに英単語を入力するよう促し、辞書に登録がなければ日本語訳を
入力するよう促してそれを訳として登録します。 辞書にすでに登録がある
場合は日本語訳を表示します。



問題 6
その他、input関数を使って自由にコードを書いてみてください！



"""